# Придумайте рекуррентное соотношение, задающее следующие числовые последовательности:
# a) 1, 2, 3, 4, . . .
# b) 0, 5, 10, 15, . . .
# c) 1, 1, 1, 1, . . .
# d) 1, −1, 1, −1, . . .
# e) 1, −2, 3, −4, 5, −6 . . .
# f) 2, 4, 8, 16, . . .
# g) 2, 4, 16, 256, . . .
# h) 0, 1, 2, 3, 0, 1, 2, 3, 0, . . .
# i) 1!, 3!, 5!, 7!, . . .
# fib1 = 1
# fib2 = 5
# print ( fib1 )
# print ( fib2 )
# n = 10
# i = 2
# summa = 0
# while i <= n:
#     summa = fib1 + fib2
#     print ( summa )
#     fib1 = fib2
#     fib2 = summa
#     i = i + 1
Е = [1]
e = 1
n = 10
i = 0
summ = 0
while i <= n:
    summ = e + 1
    Е.append (summ)
    e = summ
    i = i + 1
print (Е)    
