##Напишите программу, решающую кубическое уравнение вида y^3 + px + q = 0
##с помощью формулы Кардано. 
#Значения коэффициентов p и q вводятся с клавиатуры. Найдите корни уравнения. 
#Помните, что Python может работать с комплексными числами, но модуль math 
#использовать для их возведения в степень нельзя. Будьте внимательны с кубическим корнем: 
#кубический корень от отрицательного числа превращается в комплексное число.
print ('Введите уравнение вида y^3 + px + q = 0')

p= float (input ('Введите p '))
q= float (input ('Введите q '))


